{
  "table": "dataplatform_costs",
  "owner": "DataPlatform",
  "description": "This table contains billing information",
  "database": "billing",
  "schema": [
    {
      "name": "date",
      "type": "date",
      "description": "The date that this usage occurred."
    },
    {
      "name": "service",
      "type": "string",
      "description": "An identifier for the type of usage this is. This helps identify what kind of job this is and where it comes from."
    },
    {
      "name": "region",
      "type": "string",
      "description": "The AWS region where this usage is from (e.g `us-west-2` or `eu-west-1`)"
    },
    {
      "name": "team",
      "type": "string",
      "description": "The Samsara team this usage is attributed back to for cost allocation purposes"
    },
    {
      "name": "productgroup",
      "type": "string",
      "description": "The Samsara product group this usage is attributed back to for cost allocation purposes"
    },
    {
      "name": "dataplatformfeature",
      "type": "string",
      "description": "Represents a feature that the Data Platform team provides. Many services combine to form a single dataplatformfeature"
    },
    {
      "name": "dataplatformjobtype",
      "type": "string",
      "decsription": "An identifier that helps group the different types of jobs we run. While `service` is specific (e.g kinesisstats-merge-location), this column is more general (e.g `kinesisstats_deltalake_ingestion_merge`)"
    },

    {
      "name": "production",
      "type": "string",
      "description": "Whether this job is used for production purposes. Possible values: 'true', 'false', 'unknown'. Unknown is for values before we started setting this tag (~July 2020)"
    },
    {
      "name": "databricks_sku",
      "type": "string",
      "description": "The databricks billing SKU. See https://docs.databricks.com/administration-guide/account-settings/usage-analysis.html#billing-skus (all of ours are ENTERPRISE_* after ~Feb 2020."
    },
    {
      "name": "costAllocation",
      "type": "string",
      "description": "Where this cost is allocated to, either COGS or R&D"
    },
    {
      "name": "dbus",
      "type": "double",
      "description": "The number of DBUs for this service on this day. DBUs is a measure reported by Databricks that represents how much compute we used. We multiply the DBUs by our negotiated cost per DBU, which varies by SKU, to come up with the dbx_cost. The Databricks pricing page has a definition for what is a DBU, but 1 DBU is essentially 1 i3.xlarge machine for 1 hour: https://www.databricks.com/product/aws-pricing"
    },
    {
      "name": "dbx_cost",
      "type": "double",
      "description": "The cost for this usage that we pay to Databricks, based on our negotiated rates. Also includes an extra percentage fee for Databricks support costs"
    },
    {
      "name": "aws_ec2_cost_spot_only",
      "type": "double",
      "description": "A subset of the aws_cost. This is specifically how much of this service was spent on spot EC2 machines, if applicable"
    },
    {
      "name": "aws_ec2_cost_ondemand_only",
      "type": "double",
      "description": "A subset of the aws_cost. This is specifically how much of this service was spent on ondemand EC2 machines, if applicable"
    },
    {
      "name": "aws_cost_other",
      "type": "double",
      "description": "A subset of the aws_cost. This is the rest of the AWS Cost, not covered by other aws_cost_* columns. Examples: S3 storage, S3 requests, Data Transfer In/Out"
    },
    {
      "name": "aws_cost",
      "type": "double",
      "description": "The cost for this usage that we pay to AWS. The other aws_cost_* columns should add up to this number."
    },
    {
      "name": "category",
      "type": "string",
      "description": "Our highest level of grouping on how to group our different types of features into large buckets that can be used for executive summaries or financial modeling. Many dataplatformfeatures combine to make a single category"
    }
  ]
}
